In [1]:
import sqlite3

In [2]:
db = "./meteorites.db"

In [3]:
%load_ext sql
%config SqlMagic.feedback=False
%sql sqlite:///{db}?check_same_thread=false
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///./meteorites.db?check_same_thread=false

[('meteorites',), ('temp',)]

In [4]:
%sql SELECT sql FROM sqlite_master WHERE type='table';

 * sqlite:///./meteorites.db?check_same_thread=false

[('CREATE TABLE "meteorites" (\n    "id" INTEGER,\n    "name" TEXT NOT NULL,\n    "class" TEXT NOT NULL,\n    "mass" NUMERIC,\n    "discovery" TEXT NOT NULL,\n    "year" INTEGER,\n    "lat" NUMERIC,\n    "long" NUMERIC,\n    PRIMARY KEY("id")\n)',),
 ('CREATE TABLE "temp" (\n    "name" TEXT NOT NULL,\n    "id" INTEGER,\n    "nametype" TEXT NOT NULL,\n    "class" TEXT NOT NULL,\n    "mass" NUMERIC,\n    "discovery" TEXT NOT NULL,\n    "year" INTEGER,\n    "lat" NUMERIC,\n    "long" NUMERIC\n)',)]

In [5]:
%sql SELECT * FROM "temp" LIMIT 5;

 * sqlite:///./meteorites.db?check_same_thread=false

[('Aachen', 1, 'Valid', 'L5', 21, 'Fell', 1880, 50.775, 6.08333),
 ('Aarhus', 2, 'Valid', 'H6', 720, 'Fell', 1951, 56.18333, 10.23333),
 ('Abee', 6, 'Valid', 'EH4', 107000, 'Fell', 1952, 54.21667, -113),
 ('Acapulco', 10, 'Valid', 'Acapulcoite', 1914, 'Fell', 1976, 16.88333, -99.9),
 ('Achiras', 370, 'Valid', 'L6', 780, 'Fell', 1902, -33.16667, -64.95)]

In [6]:
%%sql
SELECT "nametype", COUNT("nametype")
FROM "temp"
GROUP BY "nametype";

 * sqlite:///./meteorites.db?check_same_thread=false

[('Relict', 75), ('Valid', 45641)]

In [7]:
%%sql
DELETE FROM "temp"
WHERE "nametype" = 'Relict';

 * sqlite:///./meteorites.db?check_same_thread=false

[]

In [8]:
%%sql
SELECT "nametype", COUNT("nametype")
FROM "temp"
GROUP BY "nametype";

 * sqlite:///./meteorites.db?check_same_thread=false

[('Valid', 45641)]

In [9]:
%%sql
SELECT COUNT("id")
FROM "temp"
WHERE "mass"=''
    OR "year" = ''
    OR "lat" = ''
    OR "long" = '';

 * sqlite:///./meteorites.db?check_same_thread=false

[(7547,)]

In [10]:
%%sql
UPDATE "temp"
SET
    "mass" = NULLIF(TRIM("mass"), ''),
    "year" = NULLIF(TRIM("year"), ''),
    "lat"  = NULLIF(TRIM("lat"), ''),
    "long" = NULLIF(TRIM("long"), '');

 * sqlite:///./meteorites.db?check_same_thread=false

[]

In [11]:
%%sql
SELECT COUNT("id")
FROM temp
WHERE mass IS NULL
   OR year IS NULL
   OR lat IS NULL
   OR long IS NULL;

 * sqlite:///./meteorites.db?check_same_thread=false

[(7547,)]

In [12]:
%%sql
UPDATE "temp"
SET
    "mass" = ROUND("mass", 2),
    "lat"  = ROUND("lat", 2),
    "long" = ROUND("long", 2);

 * sqlite:///./meteorites.db?check_same_thread=false

[]

In [13]:
%sql SELECT * FROM "temp" LIMIT 20;

 * sqlite:///./meteorites.db?check_same_thread=false

[('Aachen', 1, 'Valid', 'L5', 21, 'Fell', 1880, 50.77, 6.08),
 ('Aarhus', 2, 'Valid', 'H6', 720, 'Fell', 1951, 56.18, 10.23),
 ('Abee', 6, 'Valid', 'EH4', 107000, 'Fell', 1952, 54.22, -113),
 ('Acapulco', 10, 'Valid', 'Acapulcoite', 1914, 'Fell', 1976, 16.88, -99.9),
 ('Achiras', 370, 'Valid', 'L6', 780, 'Fell', 1902, -33.17, -64.95),
 ('Adhi Kot', 379, 'Valid', 'EH4', 4239, 'Fell', 1919, 32.1, 71.8),
 ('Adzhi-Bogdo (stone)', 390, 'Valid', 'LL3-6', 910, 'Fell', 1949, 44.83, 95.17),
 ('Agen', 392, 'Valid', 'H5', 30000, 'Fell', 1814, 44.22, 0.62),
 ('Aguada', 398, 'Valid', 'L6', 1620, 'Fell', 1930, -31.6, -65.23),
 ('Aguila Blanca', 417, 'Valid', 'L', 1440, 'Fell', 1920, -30.87, -64.55),
 ('Aioun el Atrouss', 423, 'Valid', 'Diogenite-pm', 1000, 'Fell', 1974, 16.4, -9.57),
 ('Aïr', 424, 'Valid', 'L6', 24000, 'Fell', 1925, 19.08, 8.38),
 ('Aire-sur-la-Lys', 425, 'Valid', 'Unknown', None, 'Fell', 1769, 50.67, 2.33),
 ('Akaba', 426, 'Valid', 'L6', 779, 'Fell', 1949, 29.52, 35.05),
 ('Akbarpur', 427, 'Valid', 'H4', 1800, 'Fell', 1838, 29.72, 77.95),
 ('Akwanga', 432, 'Valid', 'H', 3000, 'Fell', 1959, 8.92, 8.43),
 ('Akyumak', 433, 'Valid', 'Iron, IVA', 50000, 'Fell', 1981, 39.92, 42.82),
 ('Al Rais', 446, 'Valid', 'CR2-an', 160, 'Fell', 1957, 24.42, 39.52),
 ('Al Zarnkh', 447, 'Valid', 'LL5', 700, 'Fell', 2001, 13.66, 28.96),
 ('Alais', 448, 'Valid', 'CI1', 6000, 'Fell', 1806, 44.12, 4.08)]

In [14]:
%%sql
INSERT INTO "meteorites" ("name", "class", "mass", "discovery", "year", "lat", "long")
SELECT "name", "class", "mass", "discovery", "year", "lat", "long"
FROM (SELECT * FROM "temp"  
    ORDER BY "year" ASC, "name" ASC
);

 * sqlite:///./meteorites.db?check_same_thread=false

[]

In [15]:
%sql select * from meteorites limit 20;

 * sqlite:///./meteorites.db?check_same_thread=false

[(1, 'Apache Junction', 'Iron, IIIAB', 25000, 'Found', None, 33.45, -111.52),
 (2, 'Asarco Mexicana', 'Iron, IIIAB', None, 'Found', None, None, None),
 (3, 'Aus', 'L', 30.2, 'Found', None, -26.67, 16.25),
 (4, 'Benares (b)', 'Iron', None, 'Found', None, 25.33, 83),
 (5, 'Cacilandia', 'H6', None, 'Found', None, None, None),
 (6, 'California', 'Iron, IAB-sLL', None, 'Found', None, None, None),
 (7, 'Camp Wood', 'Iron, IIIAB', 148000, 'Found', None, 29.77, -99.88),
 (8, 'Cochabamba', 'CM2', 85, 'Found', None, None, None),
 (9, 'Cook', 'Unknown', None, 'Found', None, None, None),
 (10, 'Czestochowa Rakow I', 'Iron', None, 'Found', None, 50.8, 19.12),
 (11, 'Czestochowa Rakow II', 'Iron', None, 'Found', None, 50.8, 19.12),
 (12, 'Dhofar 1073', 'CV3', 2.72, 'Found', None, 19.33, 54.78),
 (13, 'Dhofar 1738', 'L5', 853, 'Found', None, 19.33, 54.91),
 (14, 'Dhofar 1739', 'H4', 130, 'Found', None, 19.18, 54.89),
 (15, 'Dhofar 1740', 'L6', 30.8, 'Found', None, 19.16, 54.88),
 (16, 'Dhofar 1741', 'H5', 66, 'Found', None, 19.11, 54.82),
 (17, 'Dhofar 1742', 'H5', 4.4, 'Found', None, 19.11, 54.83),
 (18, 'Dhofar 1743', 'L4', 84, 'Found', None, 19.06, 54.88),
 (19, 'Dhofar 1744', 'H5', 1414, 'Found', None, 19.15, 54.59),
 (20, 'Dhofar 1745', 'H5', 12.1, 'Found', None, 19.08, 54.51)]

In [16]:
%sql DROP TABLE "temp";

 * sqlite:///./meteorites.db?check_same_thread=false

[]